{
    "announcements": [
  {
    "id": "1",
    "name": "Quidditch Tryouts Scheduled!",
    "description": "Hufflepuff Quidditch tryouts will be held this Saturday at 10 AM on the main pitch. Bring your broomsticks and plenty of energy!"
  },
  {
    "id": "2",
    "name": "New Beater Needed!",
    "description": "Our team is looking for a new Beater to replace Zacharias Smith. Come show your skills this Friday after classes!"
  },
  {
    "id": "3",
    "name": "Practice Cancelled Due to Rain",
    "description": "Today’s practice has been cancelled due to severe weather conditions. Stay dry and study up on Quidditch strategies!"
  },
  {
    "id": "4",
    "name": "Victory Celebration!",
    "description": "Congratulations to the Hufflepuff Quidditch team for defeating Ravenclaw! Join us in the common room tonight at 8 PM for butterbeer and snacks."
  },
  {
    "id": "5",
    "name": "Quidditch Jerseys Are In!",
    "description": "Our new Quidditch jerseys have arrived! Stop by the equipment room after lunch to collect yours. Go Badgers!"
  },
  {
    "id": "6",
    "name": "Strategy Meeting This Evening",
    "description": "Team captains will hold a strategy meeting at 6 PM in the library. All players are required to attend."
  },
  {
    "id": "7",
    "name": "Cheering Charms Practice",
    "description": "Hufflepuff supporters! Learn cheering charms this Thursday with Professor Flitwick to help motivate the team during matches."
  },
  {
    "id": "8",
    "name": "Final Match of the Season",
    "description": "The final Quidditch match of the season against Gryffindor is this Saturday. Let’s show the whole school what Hufflepuff can do!"
  },
  {
    "id": "9",
    "name": "Broomstick Maintenance Reminder",
    "description": "Players, ensure your broomsticks are in top condition before practice tomorrow. Madam Hooch will be inspecting them at 9 AM."
  },
  {
    "id": "10",
    "name": "Team Photo Day",
    "description": "Wear your jerseys and meet on the Quidditch pitch at 3 PM sharp for the team photo. Smiles and snitches!"
  }
]
}


  